Repository: weiligang512/apue-test
Catalog: socket/amarok-2.1.1/po/*/amarokcollectionscanner_qt.po
Languages: nb, nds, pt_br

source: Amarok Collection Scanner
nb: Amarok samlingsskanner
nds: Sammeln-Dörkieker vun Amarok
pt_br: Escaner de coleção do Amarok

source: Note: For debugging purposes this application can be invoked from the command line, but it will not actually build a collection this way without the Amarok player.
nb: Merk: for feilsøking kan dette programmet startes fra kommandolinja, men det bygger ikke virkelig opp en samling på denne måten uten Amarok-spilleren.
nds: Beacht bitte: För de Fehlersöök lett sik dit Programm vun de Konsool ut opropen, man ahn Amarok-Afspeler stellt dat denn nich redig en Sammeln op.
pt_br: Nota: Para propósitos de depuração, este aplicativo pode ser chamado da linha de comando, mas atualmente não irá criar uma coleção dessa forma, sem o reprodutor Amarok.

source: IRC: server: irc.freenode.net / channels: #amarok, #amarok.de, #amarok.es, #amarok.fr Feedback: amarok@kde.org
nb: IRC: Tjeneren irc.freenode.net / kanalene #amarok #amarok.de #amarok.es,#amarok.fr Tilbakemeldinger: amarok@kde.org
nds: IRC: Server: irc.freenode.net / Kanaals: #amarok, #amarok.de, #amarok.es, #amarok.fr Torüchmellen: amarok@kde.org
pt_br: IRC: servidor: irc.freenode.net / canais: #amarok, #amarok.de, #amarok.es, #amarok.fr Sugestões e críticas: amarok@kde.org

source: Usage: amarokcollectionscanner [options] +Folder(s)
nb: Bruk: amarokcollectionscanner [valg] +mappe(r)
nds: Bruuk: amarokcollectionscanner [Optschonen] +Orner(n)
pt_br: Uso: amarokcollectionscanner [opções] +Pasta(s)

source: User-modifiable Options:
nb: Valg som bruker kan sette:
nds: Vun den Bruker instellbor Optschonen:
pt_br: Opções modificáveis pelo usuário:

source: +Folder(s) : Folders to scan; when using -b and -i, the path to the file generated by Amarok containing the list of folders
nb: +mappe(r) : mapper som skal skannes; når -b og -i er brukt, stien til fila som Amarok har laget og inneholder mappelista
nds: +Orner(n) : Ornern för't Dörkieken; bi Bruuk vun -b un -i de Padd na de Ornerlist-Datei, de Amarok opstellt hett.
pt_br: +Pasta(s) : Pastas a escanear; quando usado com -b e -i, o caminho para o arquivo gerado pelo Amarok contendo a lista de pastas

source: -h, --help : This help text
nb: -h, --help : denne hjelpeteksten
nds: -h, --help : Disse Hülptext
pt_br: -h, --help : Este texto de ajuda

source: -r, --recursive : Scan folders recursively
nb: -r, --recursive :Søk også i undermapper
nds: -r, --recursive : Ok all Ünnerornern dörkieken
pt_br: -r, --recursive : Escanear pastas recursivamente

source: -i, --incremental : Incremental scan (modified folders only).
nb: -i, --incremental :Fortløpende søk (bare mapper som er endret)
nds: -i, --incremental : Op Towass dörkieken (bloots ännert Ornern).
pt_br: -i, --incremental : Escaneamento incremental (somente pastas modificadas).

source: -p, --importplaylists : Import playlists
nb: -p, --importplaylists : Importer spillelister
nds: -p, --importplaylists : Afspeellisten importeren
pt_br: -p, --importplaylists : Importar listas de músicas

source: -s, --restart : After a crash, restart the scanner in its last position
pt_br: -s, --restart : Após um travamento, reiniciar o escaneamento à partir da última posição

source: -b, --batch : Run in batch mode
nb: -b, --batch : Kjør i satsvis modus
nds: -b, --batch : In Stapelbedrief utföhren
pt_br: -b, --batch : Executar em modo de lote

source: --rpath="<path>" : In full-scan batch mode, specifies a path to prepend to entries (default is the current directory)
pt_br: --rpath="<path>" : No modo de escaneamento completo em lote, especifica um caminho para anexar às entradas (o padrão é o diretório atual)
